aws/cross_account_pipeline.org
#+TITLE:     CloudFormation-Udemy
#+AUTHOR:    DeepAlgorithms
#+OPTIONS: num:nil
#+SETUPFILE: ~/mynotes/org2html/org-theme-collection/theme2.setup
#+HTML_HEAD: <link rel="icon" type="image/png" href="https://deepalgorithms.in/images/favicon.png">

source : https://www.youtube.com/watch?v=vM7X9AO7r6c&list=PLLh98oBzdb7bAuR9Nv-iGzTAxo0e1CRq3



* Manage aws-cli mulitipule  profiles
#+begin_src sh
cat ~/.aws/credentials # list of profiles in aws

aws ec2 describe-instances --profile myprofile  # list the isntance in my

# SET DEFALUT PROFILE

export AWS_DEFAULT_PROFILE=myprofile

aws codepipeline list-pipelines
aws codepipeline get-pipeline --name poc-dk-nginx-pipeline >pipeline.json
aws codepipeline list-pipelines --region us-east-1 --profile dan2505
aws codepipeline get-pipeline --name test-cloudformation-cicd --region us-east-1 --profile dan2505  > vpc-cf.json

aws codepipeline create-pipeline --profile dan2505 --cli-input-json file://new-pipe.json

aws codepipeline update-pipeline --profile dan2505 --cli-input-json file://new-pipe.json

aws codepipeline get-pipeline --region eu-west-1 --name Cross-Account-CloudFormation-CICD --profile dan2505 > failed-cross-pipeline.json

aws codepipeline update-pipeline --region eu-west-1  --profile dan2505 --cli-input-json file://failed-cross-pipeline.json


aws codepipeline update-pipeline --cli-input-json file://failed-cross-pipeline.json --profile dan2505


CA-CF-getCodeCommit-CICD-2

aws codepipeline get-pipeline --region eu-west-1 --name CA-CF-getCodeCommit-CICD-2 --profile dan2505 > failed-cross-pipeline.json

aws codepipeline update-pipeline --cli-input-json file://failed-cross-pipeline.json --profile dan2505
#+end_src
aws ec2 describe-instances --profile myprofile \\
https://www.youtube.com/watch?v=oXBknlO-9rg&list=PLLh98oBzdb7bAuR9Nv-iGzTAxo0e1CRq3&index=4
IAAS
cloud formation can be either json or yml formate
Structure of aws cloud formation json file

#+begin_src  yaml
AWSTemplateFormatVersion: "2010-09-09"
Description:
Parameters:
Metadata:
Resources:
Mappings:
Conditions:
Outputs:
Resources:

#+end_src
run cloudformation using aws-cli

#+begin_src sh 
aws cloudformation validate-template --template-body file://template.json
aws cloudformation create-stack --stack-name exampleStack --template-body file://template.json
aws cloudformation delete-stack --stack-name examplestack
aws cloudformation creatre-stack --stack-name vpc --template-body file://./infra/vpc.yml
aws cloudformation creatre-stack --stack-name iam --template-body file://./infra/iam.yml --capabilities CAPABILITY_IAM

# create loadbalancer
aws cloudformation create-stack --stack-name app-cluster --template-body file://infra/app-cluster.yml

# deploy docker image form ecr repo to ecs{Fargate}
# container defination
# service defination
# task defination
#
aws cloudformation create-stack --stack-name api --template-body file://infra/app.yml
aws cloudformation delete-stack --stack-name api
aws cloudformation deploy --template-file /path_to_template/template.json --stack-name my-new-stack --parameter-overrides Key1=Value1 Key2=Value2 --tags Key1=Value1 Key2=Value2

aws sts assume-role \
--role-arn arn:aws:iam::123456789012:role/Developer \
--role-session-name Mary-Major \
–-tags Key=displayName,Value="Mary Major" Key=emailAddress,Value="mary_major@example.com" \
--external-id Example987
#+end_src



* cross account pipeline for cloudformation deployment
https://www.youtube.com/watch?v=IbCg548TLbc

- Goal : There are two account *devops-account* and *dev-account*
   *dev-account* consist of codecommit resources  which are need to run in other account
   *devops-account* consist of codepipeline resource
   Lets consider
   dev-account : 877078200476
   devops-account : 133602912138
           

  - [ *devops-account* ]
    Create a customer managed AWS Key Management Service (AWS KMS) key that grants key usage permissions to the following:
    - devops-account's CodePipeline service role
    - dev-account

  - [ *devops-account* ]
   Create an Amazon Simple Storage Service (Amazon S3) bucket with a bucket policy that grants dev-account access to the bucket.
  
  - [ *dev-account* ]
   Create a cross-account AWS Identity and Access Management (IAM) role that allows the following:
    - CloudFormation API actions
    - Access to the Amazon S3 bucket in devops-account
    - Decryption with the customer managed AWS KMS key in devops-account

  - [ *devops-account* ]
   Add the AssumeRole permission to devops-account's CodePipeline service role to allow it to assume the cross-account role in dev-account.

  - [ *dev-account* ]
   Create a service role for the CloudFormation stack that includes the required permissions for the services deployed by the stack.

  - [ *devops-account* ]
   Update the CodePipeline configuration in devops-account to include the resources associated with dev-account           

- Resolution
