aws/cross_account_pipeline.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-03-16 Thu 11:44 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>CloudFormation-Udemy</title>
<meta name="author" content="DeepAlgorithms" />
<meta name="generator" content="Org Mode" />
<link rel="icon" type="image/png" href="https://deepalgorithms.in/assets/icons/favicon.png">
<link rel="stylesheet" type="text/css" href="readtheorg-htmlize.css"/>
<link rel="stylesheet" type="text/css" href="readtheorg.css"/>
<link rel="icon" type="image/png" href="https://deepalgorithms.in/images/favicon.png">
</head>
<body>
<div id="content" class="content">
<h1 class="title">CloudFormation-Udemy</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgcc1fa5b">Manage aws-cli mulitipule  profiles</a></li>
<li><a href="#org60de9a5">cross account pipeline for cloudformation deployment</a>
<ul>
<li><a href="#orgb528cd1">( <b>devops-account</b> ) Create a customer managed AWS KMS key that grants usage permissions to devops-account's CodePipeline service role and dev-account</a></li>
<li><a href="#orgd088c81">( <b>devops-account</b> ) Create an Amazon S3 bucket with a bucket policy that grants dev-account access to the bucket</a></li>
<li><a href="#orgd7ca703">( <b>dev-account</b> ) CREATE A CROSS-ACCOUNT IAM ROLE</a>
<ul>
<li><a href="#org5d74442">Create a second IAM policy that allows AWS KMS API actions</a></li>
<li><a href="#orgcf88f72">Create the cross-account IAM role using the policies that you created</a></li>
<li><a href="#org6125683">( <b>devops-account</b> ) Add the AssumeRole permission to devops-account's CodePipeline service role to allow it to assume the cross-account role in dev-account</a></li>
<li><a href="#org02e092f">( <b>dev-account</b> ) Create a service role for the CloudFormation stack that includes the required permissions for the services deployed by the stack</a></li>
</ul>
</li>
<li><a href="#orgd767748">AD</a></li>
</ul>
</li>
<li><a href="#orgf82c759">Create Pipeline</a></li>
<li><a href="#org4ad7b84">bash scripts</a></li>
<li><a href="#org325cdca">CI/CD pipeline : (Cloudformation) s3 creation using aws-commit + aws-deploy (Cloudl Formation)</a></li>
<li><a href="#orgbab49a0">sdfg</a></li>
<li><a href="#org3ce3e04">get source-code in another account</a></li>
<li><a href="#org25e209e">Pass role</a>
<ul>
<li><a href="#org99e9cc3"><span class="todo TODO">TODO</span> Need policy allow ecs:RegisterTaskDefinition to Run using CrossAccount-role-A-ECS</a></li>
</ul>
</li>
<li><a href="#org856cc14">AWS CodeDeploy Blue / Green Deployment to Amazon ECS</a></li>
<li><a href="#orgcb2bc60">Event Bridge for pipeline to codedeploy</a></li>
</ul>
</div>
</div>
<p>
source : <a href="https://www.youtube.com/watch?v=vM7X9AO7r6c&amp;list=PLLh98oBzdb7bAuR9Nv-iGzTAxo0e1CRq3">https://www.youtube.com/watch?v=vM7X9AO7r6c&amp;list=PLLh98oBzdb7bAuR9Nv-iGzTAxo0e1CRq3</a>
</p>



<div id="outline-container-orgcc1fa5b" class="outline-2">
<h2 id="orgcc1fa5b">Manage aws-cli mulitipule  profiles</h2>
<div class="outline-text-2" id="text-orgcc1fa5b">
<div class="org-src-container">
<pre class="src src-sh">cat ~/.aws/credentials # list of profiles in aws

aws ec2 describe-instances --profile myprofile  # list the isntance in my

# SET DEFALUT PROFILE

export AWS_DEFAULT_PROFILE=myprofile

aws codepipeline list-pipelines
aws codepipeline get-pipeline --name poc-dk-nginx-pipeline &gt;pipeline.json
aws codepipeline list-pipelines --region us-east-1 --profile dan2505
aws codepipeline get-pipeline --name test-cloudformation-cicd --region us-east-1 --profile dan2505  &gt; vpc-cf.json

aws codepipeline create-pipeline --profile dan2505 --cli-input-json file://new-pipe.json

aws codepipeline update-pipeline --profile dan2505 --cli-input-json file://new-pipe.json

aws codepipeline get-pipeline --region eu-west-1 --name Cross-Account-CloudFormation-CICD --profile dan2505 &gt; failed-cross-pipeline.json

aws codepipeline update-pipeline --region eu-west-1  --profile dan2505 --cli-input-json file://failed-cross-pipeline.json


aws codepipeline update-pipeline --cli-input-json file://failed-cross-pipeline.json --profile dan2505


CA-CF-getCodeCommit-CICD-2

aws codepipeline get-pipeline --region eu-west-1 --name CA-CF-getCodeCommit-CICD-2 --profile dan2505 &gt; failed-cross-pipeline.json

aws codepipeline update-pipeline --cli-input-json file://failed-cross-pipeline.json --profile dan2505
</pre>
</div>
<p>
aws ec2 describe-instances &#x2013;profile myprofile <br />
<a href="https://www.youtube.com/watch?v=oXBknlO-9rg&amp;list=PLLh98oBzdb7bAuR9Nv-iGzTAxo0e1CRq3&amp;index=4">https://www.youtube.com/watch?v=oXBknlO-9rg&amp;list=PLLh98oBzdb7bAuR9Nv-iGzTAxo0e1CRq3&amp;index=4</a>
IAAS
cloud formation can be either json or yml formate
Structure of aws cloud formation json file
</p>

<div class="org-src-container">
<pre class="src src-yaml">AWSTemplateFormatVersion: "2010-09-09"
Description:
Parameters:
Metadata:
Resources:
Mappings:
Conditions:
Outputs:
Resources:

</pre>
</div>
<p>
run cloudformation using aws-cli
</p>

<div class="org-src-container">
<pre class="src src-sh">aws cloudformation validate-template --template-body file://template.json
aws cloudformation create-stack --stack-name exampleStack --template-body file://template.json
aws cloudformation delete-stack --stack-name examplestack
aws cloudformation creatre-stack --stack-name vpc --template-body file://./infra/vpc.yml
aws cloudformation creatre-stack --stack-name iam --template-body file://./infra/iam.yml --capabilities CAPABILITY_IAM

# create loadbalancer
aws cloudformation create-stack --stack-name app-cluster --template-body file://infra/app-cluster.yml

# deploy docker image form ecr repo to ecs{Fargate}
# container defination
# service defination
# task defination
#
aws cloudformation create-stack --stack-name api --template-body file://infra/app.yml
aws cloudformation delete-stack --stack-name api
aws cloudformation deploy --template-file /path_to_template/template.json --stack-name my-new-stack --parameter-overrides Key1=Value1 Key2=Value2 --tags Key1=Value1 Key2=Value2

aws sts assume-role \
--role-arn arn:aws:iam::123456789012:role/Developer \
--role-session-name Mary-Major \
–-tags Key=displayName,Value="Mary Major" Key=emailAddress,Value="mary_major@example.com" \
--external-id Example987
</pre>
</div>
</div>
</div>



<div id="outline-container-org60de9a5" class="outline-2">
<h2 id="org60de9a5">cross account pipeline for cloudformation deployment</h2>
<div class="outline-text-2" id="text-org60de9a5">
<p>
<a href="https://www.youtube.com/watch?v=IbCg548TLbc">https://www.youtube.com/watch?v=IbCg548TLbc</a>
</p>

<ul class="org-ul">
<li>Goal : There are two account <b>devops-account</b> and <b>dev-account</b>
<b>dev-account</b> consist of codecommit resources  which are need to run in other account
<b>devops-account</b> consist of codepipeline resource
Lets consider
dev-account : 877078200476
devops-account : 133602912138</li>
</ul>


<ul class="org-ul">
<li>[ <b>devops-account</b> ]
Create a customer managed AWS Key Management Service (AWS KMS) key that grants key usage permissions to the following:
<ul class="org-ul">
<li>devops-account's CodePipeline service role</li>
<li>dev-account</li>
</ul></li>

<li>[ <b>devops-account</b> ]
Create an Amazon Simple Storage Service (Amazon S3) bucket with a bucket policy that grants dev-account access to the bucket.</li>

<li>[ <b>dev-account</b> ]
Create a cross-account AWS Identity and Access Management (IAM) role that allows the following:
<ul class="org-ul">
<li>CloudFormation API actions</li>
<li>Access to the Amazon S3 bucket in devops-account</li>
<li>Decryption with the customer managed AWS KMS key in devops-account</li>
</ul></li>

<li>[ <b>devops-account</b> ]
Add the AssumeRole permission to devops-account's CodePipeline service role to allow it to assume the cross-account role in dev-account.</li>

<li>[ <b>dev-account</b> ]
Create a service role for the CloudFormation stack that includes the required permissions for the services deployed by the stack.</li>

<li>[ <b>devops-account</b> ]
Update the CodePipeline configuration in devops-account to include the resources associated with dev-account</li>
</ul>
<ul class="org-ul">
<li>Resolution</li>
</ul>
</div>
