aws/cross_account_pipeline.org
** ( *devops-account* ) Create a customer managed AWS KMS key that grants usage permissions to devops-account's CodePipeline service role and dev-account
    - In devops-account, open the AWS KMS console.
    - In the navigation pane, choose Customer managed keys.
    - Choose Create key. Then, choose Symmetric.
      Note: In the Advanced options section, leave the origin as KMS.
    - For Alias, enter a name for your key.
    - (Optional) Add tags based on your use case. Then, choose Next.
    - On the Define key administrative permissions page, for Key administrators, choose your AWS Identity and Access Management (IAM) user. Also, any other users or groups that you want to serve as administrators for the key. Then, choose Next.
    - On the Define key usage permissions page, for This account, add the IAM identities that you want to have access to the key. For example: The CodePipeline service role..
    - In the Other AWS accounts section, choose Add another AWS account. Then, enter the Amazon Resource Name (ARN) of the IAM role in dev-account.
    - Choose Next. Then, choose Finish.
    - In the Customer managed keys section, choose the key that you just created. Then, copy the key's ARN.
      Important: You must have the AWS KMS key's ARN when you update your pipeline and configure your IAM policies.
** ( *devops-account* ) Create an Amazon S3 bucket with a bucket policy that grants dev-account access to the bucket
- In devops-account, open the Amazon S3 console.
  - Choose an existing Amazon S3 bucket or create a new S3 bucket to use as the ArtifactStore for CodePipeline.
      Note: Artifacts can include a stack template file, a template configuration file, or both. CodePipeline uses these artifacts to work with CloudFormation stacks and change sets. In your template configuration file, you must specify template parameter values, a stack policy, and tags.
- On the Amazon S3 details page for your bucket, choose Permissions.
- Choose Bucket Policy.
- In the bucket policy editor, enter the following policy:
     Important: Replace codepipeline-source-artifact with the SourceArtifact bucket name for CodePipeline. Replace ACCOUNT_B_NO with dev-account's account number.
  #+begin_src 
{
  "ID": "POLICY1553183091390",
  "VERSION": "2012-10-17",
  "STATEMENT": [{
      "SID": "",
      "ACTION": [
        "S3:GET*",
        "S3:PUT*"
      ],
      "EFFECT": "ALLOW",
      "RESOURCE": "ARN:AWS:S3:::CODEPIPELINE-SOURCE-ARTIFACT/*",
      "PRINCIPAL": {
        "AWS": [
          "ARN:AWS:IAM::ACCOUNT_B_NO:ROOT"
        ]
      }
    },
    {
      "SID": "",
      "ACTION": [
        "S3:LISTBUCKET"
      ],
      "EFFECT": "ALLOW",
      "RESOURCE": "ARN:AWS:S3:::CODEPIPELINE-SOURCE-ARTIFACT",
      "PRINCIPAL": {
        "AWS": [
          "ARN:AWS:IAM::ACCOUNT_B_NO:ROOT"
        ]
      }
    }
  ]
}
#+END_SRC
 - CHOOSE SAVE.
    
**  ( *dev-account* ) CREATE A CROSS-ACCOUNT IAM ROLE

CREATE AN IAM POLICY THAT ALLOWS THE FOLLOWING:
- THE PIPELINE IN devops-account TO ASSUME THE CROSS-ACCOUNT IAM ROLE IN dev-account
- CLOUDFORMATION API ACTIONS
- AMAZON S3 API ACTIONS RELATED TO THE SOURCEARTIFACT
  
+ In dev-account, open the IAM console.
+ In the navigation pane, choose Policies. Then, choose Create policy.
+ Choose the JSON tab. Then, enter the following policy into the JSON editor:
  Important: Replace codepipeline-source-artifact with your pipeline's Artifact store's bucket name.
  #+begin_src 
{
  "Version": "2012-10-17",
  "Statement": [{
      "Effect": "Allow",
      "Action": [
        "cloudformation:*",
        "iam:PassRole"
      ],
      "Resource": "*"
    },
    {
      "Effect": "Allow",
      "Action": [
        "s3:Get*",
        "s3:Put*",
        "s3:ListBucket"
      ],
      "Resource": [
        "arn:aws:s3:::codepipeline-source-artifact/*"
      ]
    }
  ]
}
#+end_src
+ Choose Review policy.
+ For Name, enter a name for the policy.
+ Choose Create policy.
*** Create a second IAM policy that allows AWS KMS API actions

- In dev-account, open the IAM console.
- In the navigation pane, choose Policies. Then, choose Create policy.
- Choose the JSON tab. Then, enter the following policy into the JSON editor:
  Important: Replace arn:aws:kms:REGION:ACCOUNT_A_NO:key/key-id with your AWS KMS key's ARN that you copied earlier.
  #+begin_src 
{
  "Version": "2012-10-17",
  "Statement": [{
    "Effect": "Allow",
    "Action": [
      "kms:DescribeKey",
      "kms:GenerateDataKey*",
      "kms:Encrypt",
      "kms:ReEncrypt*",
      "kms:Decrypt"
    ],
    "Resource": [
      "arn:aws:kms:REGION:ACCOUNT_A_NO:key/key-id"
    ]
  }]
}
#+end_src
- Choose Review policy.
- For Name, enter a name for the policy.
- Choose Create policy.

*** Create the cross-account IAM role using the policies that you created

- In dev-account, open the IAM console.
- In the navigation pane, choose Roles.
- Choose Create role.
- Choose Another AWS account.
- For Account ID, enter devops-account's account ID.
- Choose Next: Permissions. Then, complete the steps to create the IAM role.
- Attach the cross-account role policy and KMS key policy to the role that you created. For instructions, see Adding and removing IAM identity permissions.
  
*** ( *devops-account* ) Add the AssumeRole permission to devops-account's CodePipeline service role to allow it to assume the cross-account role in dev-account
- In devops-account, open the IAM console.
- In the navigation pane, choose Roles.
- Choose the IAM service role that you're using for CodePipeline.
- Choose Add inline policy.
- Choose the JSON tab. Then, enter the following policy into the JSON editor:
  Important: Replace ACCOUNT_B_NO with dev-account's account number.
  #+begin_src 
{
  "Version": "2012-10-17",
  "Statement": {
    "Effect": "Allow",
    "Action": "sts:AssumeRole",
    "Resource": [
      "arn:aws:iam::ACCOUNT_B_NO:role/*"
    ]
  }
}
#+end_src
- Choose Review policy, and then create the policy.
