aws/cross_account_pipeline.html
<div id="outline-container-orgb528cd1" class="outline-3">
<h3 id="orgb528cd1">( <b>devops-account</b> ) Create a customer managed AWS KMS key that grants usage permissions to devops-account's CodePipeline service role and dev-account</h3>
<div class="outline-text-3" id="text-orgb528cd1">
<ul class="org-ul">
<li>In devops-account, open the AWS KMS console.</li>
<li>In the navigation pane, choose Customer managed keys.</li>
<li>Choose Create key. Then, choose Symmetric.
Note: In the Advanced options section, leave the origin as KMS.</li>
<li>For Alias, enter a name for your key.</li>
<li>(Optional) Add tags based on your use case. Then, choose Next.</li>
<li>On the Define key administrative permissions page, for Key administrators, choose your AWS Identity and Access Management (IAM) user. Also, any other users or groups that you want to serve as administrators for the key. Then, choose Next.</li>
<li>On the Define key usage permissions page, for This account, add the IAM identities that you want to have access to the key. For example: The CodePipeline service role..</li>
<li>In the Other AWS accounts section, choose Add another AWS account. Then, enter the Amazon Resource Name (ARN) of the IAM role in dev-account.</li>
<li>Choose Next. Then, choose Finish.</li>
<li>In the Customer managed keys section, choose the key that you just created. Then, copy the key's ARN.
Important: You must have the AWS KMS key's ARN when you update your pipeline and configure your IAM policies.</li>
</ul>
</div>
</div>
<div id="outline-container-orgd088c81" class="outline-3">
<h3 id="orgd088c81">( <b>devops-account</b> ) Create an Amazon S3 bucket with a bucket policy that grants dev-account access to the bucket</h3>
<div class="outline-text-3" id="text-orgd088c81">
<ul class="org-ul">
<li>In devops-account, open the Amazon S3 console.
<ul class="org-ul">
<li>Choose an existing Amazon S3 bucket or create a new S3 bucket to use as the ArtifactStore for CodePipeline.
Note: Artifacts can include a stack template file, a template configuration file, or both. CodePipeline uses these artifacts to work with CloudFormation stacks and change sets. In your template configuration file, you must specify template parameter values, a stack policy, and tags.</li>
</ul></li>
<li>On the Amazon S3 details page for your bucket, choose Permissions.</li>
<li>Choose Bucket Policy.</li>
<li><p>
In the bucket policy editor, enter the following policy:
Important: Replace codepipeline-source-artifact with the SourceArtifact bucket name for CodePipeline. Replace ACCOUNT<sub>B</sub><sub>NO</sub> with dev-account's account number.
</p>
<pre class="example">
{
  "ID": "POLICY1553183091390",
  "VERSION": "2012-10-17",
  "STATEMENT": [{
      "SID": "",
      "ACTION": [
	"S3:GET*",
	"S3:PUT*"
      ],
      "EFFECT": "ALLOW",
      "RESOURCE": "ARN:AWS:S3:::CODEPIPELINE-SOURCE-ARTIFACT/*",
      "PRINCIPAL": {
	"AWS": [
	  "ARN:AWS:IAM::ACCOUNT_B_NO:ROOT"
	]
      }
    },
    {
      "SID": "",
      "ACTION": [
	"S3:LISTBUCKET"
      ],
      "EFFECT": "ALLOW",
      "RESOURCE": "ARN:AWS:S3:::CODEPIPELINE-SOURCE-ARTIFACT",
      "PRINCIPAL": {
	"AWS": [
	  "ARN:AWS:IAM::ACCOUNT_B_NO:ROOT"
	]
      }
    }
  ]
}
</pre>
<ul class="org-ul">
<li>CHOOSE SAVE.</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgd7ca703" class="outline-3">
<h3 id="orgd7ca703">( <b>dev-account</b> ) CREATE A CROSS-ACCOUNT IAM ROLE</h3>
<div class="outline-text-3" id="text-orgd7ca703">
<p>
CREATE AN IAM POLICY THAT ALLOWS THE FOLLOWING:
</p>
<ul class="org-ul">
<li>THE PIPELINE IN devops-account TO ASSUME THE CROSS-ACCOUNT IAM ROLE IN dev-account</li>
<li>CLOUDFORMATION API ACTIONS</li>
<li>AMAZON S3 API ACTIONS RELATED TO THE SOURCEARTIFACT</li>

<li>In dev-account, open the IAM console.</li>
<li>In the navigation pane, choose Policies. Then, choose Create policy.</li>
<li><p>
Choose the JSON tab. Then, enter the following policy into the JSON editor:
Important: Replace codepipeline-source-artifact with your pipeline's Artifact store's bucket name.
</p>
<pre class="example">
{
  "Version": "2012-10-17",
  "Statement": [{
      "Effect": "Allow",
      "Action": [
	"cloudformation:*",
	"iam:PassRole"
      ],
      "Resource": "*"
    },
    {
      "Effect": "Allow",
      "Action": [
	"s3:Get*",
	"s3:Put*",
	"s3:ListBucket"
      ],
      "Resource": [
	"arn:aws:s3:::codepipeline-source-artifact/*"
      ]
    }
  ]
}
</pre></li>
<li>Choose Review policy.</li>
<li>For Name, enter a name for the policy.</li>
<li>Choose Create policy.</li>
</ul>
</div>
<div id="outline-container-org5d74442" class="outline-4">
<h4 id="org5d74442">Create a second IAM policy that allows AWS KMS API actions</h4>
<div class="outline-text-4" id="text-org5d74442">
<ul class="org-ul">
<li>In dev-account, open the IAM console.</li>
<li>In the navigation pane, choose Policies. Then, choose Create policy.</li>
<li><p>
Choose the JSON tab. Then, enter the following policy into the JSON editor:
Important: Replace arn:aws:kms:REGION:ACCOUNT<sub>A</sub><sub>NO</sub>:key/key-id with your AWS KMS key's ARN that you copied earlier.
</p>
<pre class="example">
{
  "Version": "2012-10-17",
  "Statement": [{
    "Effect": "Allow",
    "Action": [
      "kms:DescribeKey",
      "kms:GenerateDataKey*",
      "kms:Encrypt",
      "kms:ReEncrypt*",
      "kms:Decrypt"
    ],
    "Resource": [
      "arn:aws:kms:REGION:ACCOUNT_A_NO:key/key-id"
    ]
  }]
}
</pre></li>
<li>Choose Review policy.</li>
<li>For Name, enter a name for the policy.</li>
<li>Choose Create policy.</li>
</ul>
</div>
</div>

<div id="outline-container-orgcf88f72" class="outline-4">
<h4 id="orgcf88f72">Create the cross-account IAM role using the policies that you created</h4>
<div class="outline-text-4" id="text-orgcf88f72">
<ul class="org-ul">
<li>In dev-account, open the IAM console.</li>
<li>In the navigation pane, choose Roles.</li>
<li>Choose Create role.</li>
<li>Choose Another AWS account.</li>
<li>For Account ID, enter devops-account's account ID.</li>
<li>Choose Next: Permissions. Then, complete the steps to create the IAM role.</li>
<li>Attach the cross-account role policy and KMS key policy to the role that you created. For instructions, see Adding and removing IAM identity permissions.</li>
</ul>
</div>
</div>

<div id="outline-container-org6125683" class="outline-4">
<h4 id="org6125683">( <b>devops-account</b> ) Add the AssumeRole permission to devops-account's CodePipeline service role to allow it to assume the cross-account role in dev-account</h4>
<div class="outline-text-4" id="text-org6125683">
<ul class="org-ul">
<li>In devops-account, open the IAM console.</li>
<li>In the navigation pane, choose Roles.</li>
<li>Choose the IAM service role that you're using for CodePipeline.</li>
<li>Choose Add inline policy.</li>
<li><p>
Choose the JSON tab. Then, enter the following policy into the JSON editor:
Important: Replace ACCOUNT<sub>B</sub><sub>NO</sub> with dev-account's account number.
</p>
<pre class="example">
{
  "Version": "2012-10-17",
  "Statement": {
    "Effect": "Allow",
    "Action": "sts:AssumeRole",
    "Resource": [
      "arn:aws:iam::ACCOUNT_B_NO:role/*"
    ]
  }
}
</pre></li>
<li>Choose Review policy, and then create the policy.</li>
</ul>
</div>
</div>
