aws/cross_account_pipeline.org
*** ( *dev-account* ) Create a service role for the CloudFormation stack that includes the required permissions for the services deployed by the stack
Note: This service role is configured directly on the CloudFormation stack in dev-account. The role must include the permissions for the services deployed by the stack.

- In dev-account, open the IAM console.

- In the navigation pane, choose Roles.

- Create a role for AWS CloudFormation to use when launching services on your behalf.

- Apply permissions to your role based on your use case.

Important: Make sure that your trust policy is for AWS CloudFormation, and that your role has permissions to access services deployed by the stack.
[ *devops-account* ] Update the CodePipeline configuration to include the resources associated with dev-account

Note: If you receive errors when running AWS Command Line Interface (AWS CLI) commands, make sure that you’re using the most recent AWS CLI version.

You can't use the CodePipeline console to create or edit a pipeline that uses resources associated with another account. However, you can use the console to create the general structure of the pipeline. Then, you can use the AWS CLI to edit the pipeline and add the resources associated with the other account. Or, you can update a current pipeline with the resources for the new pipeline. For more information, see Create a pipeline in CodePipeline.

- Get the pipeline JSON structure by running the following AWS CLI command:
   #+begin_src
aws codepipeline list-pipelines
aws codepipeline get-pipeline --name poc-dk-nginx-pipeline >pipeline.json
#+end_src
- In your local pipeline.json file, confirm that the encryptionKey ID under artifactStore contains the ID with the AWS KMS key's ARN.
   Note: For more information on pipeline structure, see create-pipeline in the AWS CLI Command Reference.
- In the pipeline.json file, update the AWS CloudFormation action configuration.
   Note: The RoleArn inside the action configuration JSON structure for your pipeline is the role for the CloudFormation stack (CFN_STACK_ROLE). The roleArn outside the action configuration JSON structure is the cross-account role that the pipeline assumes to operate a CloudFormation stack (CROSS_ACCOUNT_ROLE).
- Verify that the role is updated for both of the following:
   The RoleArn inside the action configuration JSON structure for your pipeline.
   The roleArn outside the action configuration JSON structure for your pipeline.
   Note: In the following code example, RoleArn is the role passed to AWS CloudFormation to launch the stack. CodePipeline uses roleArn to operate an AWS CloudFormation stack.
   #+begin_src 
{
  "name": "Prod_Deploy",
  "actions": [{
    "inputArtifacts": [{
      "name": "MyApp"
    }],
    "name": "test-cfn-x",
    "actionTypeId": {
      "category": "Deploy",
      "owner": "AWS",
      "version": "1",
      "provider": "CloudFormation"
    },
    "outputArtifacts": [],
    "configuration": {
      "ActionMode": "CHANGE_SET_REPLACE",
      "ChangeSetName": "test",
      "RoleArn": "ARN_FOR_CFN_STACK_ROLE",
      "Capabilities": "CAPABILITY_IAM",
      "StackName": "test-cfn-sam",
      "TemplatePath": "MyApp::template.yaml"
    },
    "roleArn": "ARN_FOR_CROSS_ACCOUNT_ROLE",
    "runOrder": 1
  }]
}
   #+end_src
- Remove the metadata configuration from the pipeline.json file. For example:
   #+begin_src 
"metadata": {
  "pipelineArn": "arn:aws:codepipeline:REGION:ACC:my_test",
  "updated": 1551216777.183,
  "created": 1551207202.964
}
   #+end_src
   Important: To align with proper JSON formatting, remove the comma before the metadata section.
- (Optional) To create a pipeline and update the JSON structure, run the following command to update the pipeline with the new configuration file:
   #+begin_src 
aws codepipeline update-pipeline --cli-input-json file://pipeline.json
#+end_src   
- (Optional) To use a current pipeline and update the JSON structure, run the following command to create a new pipeline:


