aws/cross_account_pipeline.html
<div id="outline-container-org02e092f" class="outline-4">
<h4 id="org02e092f">( <b>dev-account</b> ) Create a service role for the CloudFormation stack that includes the required permissions for the services deployed by the stack</h4>
<div class="outline-text-4" id="text-org02e092f">
<p>
Note: This service role is configured directly on the CloudFormation stack in dev-account. The role must include the permissions for the services deployed by the stack.
</p>

<ul class="org-ul">
<li>In dev-account, open the IAM console.</li>

<li>In the navigation pane, choose Roles.</li>

<li>Create a role for AWS CloudFormation to use when launching services on your behalf.</li>

<li>Apply permissions to your role based on your use case.</li>
</ul>

<p>
Important: Make sure that your trust policy is for AWS CloudFormation, and that your role has permissions to access services deployed by the stack.
[ <b>devops-account</b> ] Update the CodePipeline configuration to include the resources associated with dev-account
</p>

<p>
Note: If you receive errors when running AWS Command Line Interface (AWS CLI) commands, make sure that you’re using the most recent AWS CLI version.
</p>

<p>
You can't use the CodePipeline console to create or edit a pipeline that uses resources associated with another account. However, you can use the console to create the general structure of the pipeline. Then, you can use the AWS CLI to edit the pipeline and add the resources associated with the other account. Or, you can update a current pipeline with the resources for the new pipeline. For more information, see Create a pipeline in CodePipeline.
</p>

<ul class="org-ul">
<li><p>
Get the pipeline JSON structure by running the following AWS CLI command:
</p>
<pre class="example">
aws codepipeline list-pipelines
aws codepipeline get-pipeline --name poc-dk-nginx-pipeline &gt;pipeline.json
</pre></li>
<li>In your local pipeline.json file, confirm that the encryptionKey ID under artifactStore contains the ID with the AWS KMS key's ARN.
Note: For more information on pipeline structure, see create-pipeline in the AWS CLI Command Reference.</li>
<li>In the pipeline.json file, update the AWS CloudFormation action configuration.
Note: The RoleArn inside the action configuration JSON structure for your pipeline is the role for the CloudFormation stack (CFN<sub>STACK</sub><sub>ROLE</sub>). The roleArn outside the action configuration JSON structure is the cross-account role that the pipeline assumes to operate a CloudFormation stack (CROSS<sub>ACCOUNT</sub><sub>ROLE</sub>).</li>
<li><p>
Verify that the role is updated for both of the following:
The RoleArn inside the action configuration JSON structure for your pipeline.
The roleArn outside the action configuration JSON structure for your pipeline.
Note: In the following code example, RoleArn is the role passed to AWS CloudFormation to launch the stack. CodePipeline uses roleArn to operate an AWS CloudFormation stack.
</p>
<pre class="example">
{
  "name": "Prod_Deploy",
  "actions": [{
    "inputArtifacts": [{
      "name": "MyApp"
    }],
    "name": "test-cfn-x",
    "actionTypeId": {
      "category": "Deploy",
      "owner": "AWS",
      "version": "1",
      "provider": "CloudFormation"
    },
    "outputArtifacts": [],
    "configuration": {
      "ActionMode": "CHANGE_SET_REPLACE",
      "ChangeSetName": "test",
      "RoleArn": "ARN_FOR_CFN_STACK_ROLE",
      "Capabilities": "CAPABILITY_IAM",
      "StackName": "test-cfn-sam",
      "TemplatePath": "MyApp::template.yaml"
    },
    "roleArn": "ARN_FOR_CROSS_ACCOUNT_ROLE",
    "runOrder": 1
  }]
}
</pre></li>
<li><p>
Remove the metadata configuration from the pipeline.json file. For example:
</p>
<pre class="example">
"metadata": {
  "pipelineArn": "arn:aws:codepipeline:REGION:ACC:my_test",
  "updated": 1551216777.183,
  "created": 1551207202.964
}
</pre>
<p>
Important: To align with proper JSON formatting, remove the comma before the metadata section.
</p></li>
<li><p>
(Optional) To create a pipeline and update the JSON structure, run the following command to update the pipeline with the new configuration file:
</p>
<pre class="example">
aws codepipeline update-pipeline --cli-input-json file://pipeline.json
</pre></li>
<li>(Optional) To use a current pipeline and update the JSON structure, run the following command to create a new pipeline:</li>
</ul>
</div>
</div>
</div>
