aws/cross_account_pipeline.org
** AD
Account A: 836475480064  TSCTESTING
Account B:  749613781581 AWSReservedSSO_Admin_7db

- [Account A] Create Role  *cross-account-role-A*
  - Role Name : *cross-account-role-A*
      - Trust Relationship
        #+begin_src 
{
    "Version": "2012-10-17",
    "Statement": [
      {
        "Effect": "Allow",
        "Principal": {
          "Service": "codepipeline.amazonaws.com" 
        },
        "Action": "sts:AssumeRole",
        }
    ]
}
      #+end_src
    - Permission
      - AmazonS3FullAccess
      - AWSCodeCommitFullAccess
  - get the *Role ARN*: arn:as:iam::836475480064:role/cross-account-role-A     
- [Account A] Create CMK's (KMS) : 
  - symmetic
  - KMS
  - *alias: crosskey*
  - *key administrative permission*
  - [AWS Identitiy and IAM user or group who want to give permission] [/] [User]
  - *key usage permissions*
    - choose : *cross-account* that we create above 

  - Attach the above role *cross-account-role-A*
  - Other *AWS accounts*
    - Give Account ANR : arn:aws:iam:: *749613781581* : root
  - get cmk-kms ARN : *arn:aws:kms:us-east-2:836475480064:key/9cfa5357-8011-47f9-9565-28982e63100*    
- [Account A] Create S3 buckets:
  - Name: *source-artifact-india* ,
  - access:  block all public acess
  - add policy to s3 bucket
    #+begin_src 
{
  "Id": "Policy1553183091390",
  "Version": "2012-10-17",
  "Statement": [{
      "Sid": "",
      "Action": [
        "s3:Get*",
        "s3:Put*"
      ],
       "Effect": "Allow",
      "Resource": "arn:aws:s3:::codepipeline-source-artifact/*",
      "Principal": {
        "AWS": [
          "arn:aws:iam::ACCOUNT_B_NO:root"
        ]
      }
    },
    {
      "Sid": "",
      "Action": [
        "s3:ListBucket"
      ],
      "Effect": "Allow",
      "Resource": "arn:aws:s3:::codepipeline-source-artifact",
      "Principal": {
        "AWS": [
          "arn:aws:iam::ACCOUNT_B_NO:root"
        ]
      }
    }
  ]
}
#+end_src
- [Account B] Create Policy :  *cross-account-s3-access* : Allow access to S3 (read and write) to codepipeline
  - Name: cross-account-s3-access
  - json file repalce *source-artifact-inida* with your [Account A] S3 Bucket
    #+begin_src 
{
  "Version": "2012-10-17",
  "Statement": [{
      "Effect": "Allow",
      "Action": [
        "cloudformation:*",
        "iam:PassRole"
      ],
      "Resource": "*"
    },
    {
      "Effect": "Allow",
      "Action": [
        "s3:Get*",
        "s3:Put*",
        "s3:ListBucket"
      ],
      "Resource": [
        "arn:aws:s3:::codepipeline-source-artifact/*"
      ]
    }
  ]
}
#+end_src
- [Account B] Create Policy :  *cross-account-kms-key-access* Allow KMS to run from other [Account A]
  - Name : *cross-account-kms-key-access*
  - json file *replace* *Resource kms-key with [Account A] ARN*
      #+begin_src 
{
  "Version": "2012-10-17",
  "Statement": [{
    "Effect": "Allow",
    "Action": [
      "kms:DescribeKey",
      "kms:GenerateDataKey*",
      "kms:Encrypt",
      "kms:ReEncrypt*",
      "kms:Decrypt"
    ],
    "Resource": [
      "arn:aws:kms:REGION:ACCOUNT_A_NO:key/key-id"
    ]
  }]
}
#+end_src  
- [Account B] Create Role : *cross-account-role-B* Allow to access S3[from Account A] and Key[from Account B] 
  - Trusted Entity : *Another  AWS account*  
    - Accound ID: 87647580064
  - Seletec Policy
    - cross-account-s3-access  
    - cross-account-kms-key-access create above
- [Account B] Create Role: *cross-account-role-CF-role* Allow to run Cloudformation
  - Attach Policy : AdministratorsAccess
* Create Pipeline 
- [Account A] Create a pipeline with role: *cross-account-role-A*
  - Name: cross-account-pipeline
  - Existing Service: *cross-account-role-A*  
  - Artifact store:
    - Custome:  *source-artifiacts-india*
  - Source stage : CodeCommit
    - Repo :     
   
          
  
  

    
  

  


* bash scripts
find . -name *.c | xargs grep "writeText"

aws cloudformation deploy --template-file /path_to_template/template.json --stack-name my-new-stack --parameter-overrides Key1=Value1 Key2=Value2 --tags Key1=Value1 Key2=Value2

* CI/CD pipeline : (Cloudformation) s3 creation using aws-commit + aws-deploy (Cloudl Formation) 
https://www.youtube.com/watch?v=oXBknlO-9rg&list=PLLh98oBzdb7bAuR9Nv-iGzTAxo0e1CRq3&index=4



* sdfg



Account A :                     dankarthik2505@gmail.condition
Account-ID :                    918175365727
codecommit ARN :                arn:aws:codecommit:us-east-1:918175365727:test-cf
- repo :                        test-cf
- branch :                      master
KMS CMK key ARN                 arn:aws:kms:eu-west-1:918175365727:key/7bc79cce-3b1a-4a61-862e-747990aa1173
S3 ARN                          arn:aws:s3:::artifact-source
cross-account-role-A ARN        arn:aws:iam::918175365727:role/cross-account-role-A

Account B :                    @deepalgorithms.in
Account-ID :                   548593215839
cross-account-role-B  ARN      arn:aws:iam::548593215839:role/cross-account-role-B
cross-CF-role  ARN             arn:aws:iam::548593215839:role/CloudformationExecutionRole

Stack Name : 



* get source-code in another account
pipeline structure :
https://docs.aws.amazon.com/codepipeline/latest/userguide/reference-pipeline-structure.html
permission json

https://docs.aws.amazon.com/codecommit/latest/userguide/security-iam-awsmanpol.html

https://docs.aws.amazon.com/codecommit/latest/userguide/security-iam-awsmanpol.html
AWS managed policy: AWSCodeCommitFullAccess

#+begin_src json
{
    "Version": "2012-10-17",
    "Statement": [
        {
            "Sid": "VisualEditor0",
            "Effect": "Allow",
            "Action": [
                "iam:PassRole",
                "cloudformation:*",
                "codecommit:*"
            ],
            "Resource": "*"
        },
        {
            "Sid": "VisualEditor1",
            "Effect": "Allow",
            "Action": "s3:ListBucket",
            "Resource": "arn:aws:s3:::artifact-source/*"
        },
        {
            "Sid": "VisualEditor2",
            "Effect": "Allow",
            "Action": [
                "s3:Get*",
                "s3:Put*"
            ],
            "Resource": "arn:aws:s3:::artifact-source/*"
        }
    ]
}
#+end_src




