aws/cross_account_pipeline.html


<div id="outline-container-orgd767748" class="outline-3">
<h3 id="orgd767748">AD</h3>
<div class="outline-text-3" id="text-orgd767748">
<p>
Account A: 836475480064  TSCTESTING
Account B:  749613781581 AWSReservedSSO<sub>Admin</sub><sub>7db</sub>
</p>

<ul class="org-ul">
<li>[Account A] Create Role  <b>cross-account-role-A</b>
<ul class="org-ul">
<li><p>
Role Name : <b>cross-account-role-A</b>
</p>
<ul class="org-ul">
<li><p>
Trust Relationship
</p>
<pre class="example">
{
    "Version": "2012-10-17",
    "Statement": [
      {
	"Effect": "Allow",
	"Principal": {
	  "Service": "codepipeline.amazonaws.com" 
	},
	"Action": "sts:AssumeRole",
	}
    ]
}
</pre></li>
</ul>
<ul class="org-ul">
<li>Permission
<ul class="org-ul">
<li>AmazonS3FullAccess</li>
<li>AWSCodeCommitFullAccess</li>
</ul></li>
</ul></li>
<li>get the <b>Role ARN</b>: arn:as:iam::836475480064:role/cross-account-role-A</li>
</ul></li>
<li>[Account A] Create CMK's (KMS) : 
<ul class="org-ul">
<li>symmetic</li>
<li>KMS</li>
<li><b>alias: crosskey</b></li>
<li><b>key administrative permission</b></li>
<li>[AWS Identitiy and IAM user or group who want to give permission] <code>[/]</code> [User]</li>
<li><b>key usage permissions</b>
<ul class="org-ul">
<li>choose : <b>cross-account</b> that we create above</li>
</ul></li>

<li>Attach the above role <b>cross-account-role-A</b></li>
<li>Other <b>AWS accounts</b>
<ul class="org-ul">
<li>Give Account ANR : arn:aws:iam:: <b>749613781581</b> : root</li>
</ul></li>
<li>get cmk-kms ARN : <b>arn:aws:kms:us-east-2:836475480064:key/9cfa5357-8011-47f9-9565-28982e63100</b></li>
</ul></li>
<li>[Account A] Create S3 buckets:
<ul class="org-ul">
<li>Name: <b>source-artifact-india</b> ,</li>
<li>access:  block all public acess</li>
<li><p>
add policy to s3 bucket
</p>
<pre class="example">
{
  "Id": "Policy1553183091390",
  "Version": "2012-10-17",
  "Statement": [{
      "Sid": "",
      "Action": [
	"s3:Get*",
	"s3:Put*"
      ],
       "Effect": "Allow",
      "Resource": "arn:aws:s3:::codepipeline-source-artifact/*",
      "Principal": {
	"AWS": [
	  "arn:aws:iam::ACCOUNT_B_NO:root"
	]
      }
    },
    {
      "Sid": "",
      "Action": [
	"s3:ListBucket"
      ],
      "Effect": "Allow",
      "Resource": "arn:aws:s3:::codepipeline-source-artifact",
      "Principal": {
	"AWS": [
	  "arn:aws:iam::ACCOUNT_B_NO:root"
	]
      }
    }
  ]
}
</pre></li>
</ul></li>
<li>[Account B] Create Policy :  <b>cross-account-s3-access</b> : Allow access to S3 (read and write) to codepipeline
<ul class="org-ul">
<li>Name: cross-account-s3-access</li>
<li><p>
json file repalce <b>source-artifact-inida</b> with your [Account A] S3 Bucket
</p>
<pre class="example">
{
  "Version": "2012-10-17",
  "Statement": [{
      "Effect": "Allow",
      "Action": [
	"cloudformation:*",
	"iam:PassRole"
      ],
      "Resource": "*"
    },
    {
      "Effect": "Allow",
      "Action": [
	"s3:Get*",
	"s3:Put*",
	"s3:ListBucket"
      ],
      "Resource": [
	"arn:aws:s3:::codepipeline-source-artifact/*"
      ]
    }
  ]
}
</pre></li>
</ul></li>
<li>[Account B] Create Policy :  <b>cross-account-kms-key-access</b> Allow KMS to run from other [Account A]
<ul class="org-ul">
<li>Name : <b>cross-account-kms-key-access</b></li>
<li><p>
json file <b>replace</b> <b>Resource kms-key with [Account A] ARN</b>
</p>
<pre class="example">
{
  "Version": "2012-10-17",
  "Statement": [{
    "Effect": "Allow",
    "Action": [
      "kms:DescribeKey",
      "kms:GenerateDataKey*",
      "kms:Encrypt",
      "kms:ReEncrypt*",
      "kms:Decrypt"
    ],
    "Resource": [
      "arn:aws:kms:REGION:ACCOUNT_A_NO:key/key-id"
    ]
  }]
}
</pre></li>
</ul></li>
<li>[Account B] Create Role : <b>cross-account-role-B</b> Allow to access S3[from Account A] and Key[from Account B] 
<ul class="org-ul">
<li>Trusted Entity : <b>Another  AWS account</b>  
<ul class="org-ul">
<li>Accound ID: 87647580064</li>
</ul></li>
<li>Seletec Policy
<ul class="org-ul">
<li>cross-account-s3-access</li>
<li>cross-account-kms-key-access create above</li>
</ul></li>
</ul></li>
<li>[Account B] Create Role: <b>cross-account-role-CF-role</b> Allow to run Cloudformation
<ul class="org-ul">
<li>Attach Policy : AdministratorsAccess</li>
</ul></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgf82c759" class="outline-2">
<h2 id="orgf82c759">Create Pipeline</h2>
<div class="outline-text-2" id="text-orgf82c759">
<ul class="org-ul">
<li>[Account A] Create a pipeline with role: <b>cross-account-role-A</b>
<ul class="org-ul">
<li>Name: cross-account-pipeline</li>
<li>Existing Service: <b>cross-account-role-A</b></li>
<li>Artifact store:
<ul class="org-ul">
<li>Custome:  <b>source-artifiacts-india</b></li>
</ul></li>
<li>Source stage : CodeCommit
<ul class="org-ul">
<li>Repo :</li>
</ul></li>
</ul></li>
</ul>
</div>
</div>











<div id="outline-container-org4ad7b84" class="outline-2">
<h2 id="org4ad7b84">bash scripts</h2>
<div class="outline-text-2" id="text-org4ad7b84">
<p>
find . -name *.c | xargs grep "writeText"
</p>

<p>
aws cloudformation deploy &#x2013;template-file /path<sub>to</sub><sub>template</sub>/template.json &#x2013;stack-name my-new-stack &#x2013;parameter-overrides Key1=Value1 Key2=Value2 &#x2013;tags Key1=Value1 Key2=Value2
</p>
</div>
</div>

<div id="outline-container-org325cdca" class="outline-2">
<h2 id="org325cdca">CI/CD pipeline : (Cloudformation) s3 creation using aws-commit + aws-deploy (Cloudl Formation)</h2>
<div class="outline-text-2" id="text-org325cdca">
<p>
<a href="https://www.youtube.com/watch?v=oXBknlO-9rg&amp;list=PLLh98oBzdb7bAuR9Nv-iGzTAxo0e1CRq3&amp;index=4">https://www.youtube.com/watch?v=oXBknlO-9rg&amp;list=PLLh98oBzdb7bAuR9Nv-iGzTAxo0e1CRq3&amp;index=4</a>
</p>
</div>
</div>



<div id="outline-container-orgbab49a0" class="outline-2">
<h2 id="orgbab49a0">sdfg</h2>
<div class="outline-text-2" id="text-orgbab49a0">
<p>
Account A :                     dankarthik2505@gmail.condition
Account-ID :                    918175365727
codecommit ARN :                arn:aws:codecommit:us-east-1:918175365727:test-cf
</p>
<ul class="org-ul">
<li>repo :                        test-cf</li>
<li>branch :                      master</li>
</ul>
<p>
KMS CMK key ARN                 arn:aws:kms:eu-west-1:918175365727:key/7bc79cce-3b1a-4a61-862e-747990aa1173
S3 ARN                          arn:aws:s3:::artifact-source
cross-account-role-A ARN        arn:aws:iam::918175365727:role/cross-account-role-A
</p>

<p>
Account B :                    @deepalgorithms.in
Account-ID :                   548593215839
cross-account-role-B  ARN      arn:aws:iam::548593215839:role/cross-account-role-B
cross-CF-role  ARN             arn:aws:iam::548593215839:role/CloudformationExecutionRole
</p>

<p>
Stack Name : 
</p>
</div>
</div>



<div id="outline-container-org3ce3e04" class="outline-2">
<h2 id="org3ce3e04">get source-code in another account</h2>
<div class="outline-text-2" id="text-org3ce3e04">
<p>
pipeline structure :
<a href="https://docs.aws.amazon.com/codepipeline/latest/userguide/reference-pipeline-structure.html">https://docs.aws.amazon.com/codepipeline/latest/userguide/reference-pipeline-structure.html</a>
permission json
</p>

<p>
<a href="https://docs.aws.amazon.com/codecommit/latest/userguide/security-iam-awsmanpol.html">https://docs.aws.amazon.com/codecommit/latest/userguide/security-iam-awsmanpol.html</a>
</p>

<p>
<a href="https://docs.aws.amazon.com/codecommit/latest/userguide/security-iam-awsmanpol.html">https://docs.aws.amazon.com/codecommit/latest/userguide/security-iam-awsmanpol.html</a>
AWS managed policy: AWSCodeCommitFullAccess
</p>

<div class="org-src-container">
<pre class="src src-json">{
    "Version": "2012-10-17",
    "Statement": [
	{
	    "Sid": "VisualEditor0",
	    "Effect": "Allow",
	    "Action": [
		"iam:PassRole",
		"cloudformation:*",
		"codecommit:*"
	    ],
	    "Resource": "*"
	},
	{
	    "Sid": "VisualEditor1",
	    "Effect": "Allow",
	    "Action": "s3:ListBucket",
	    "Resource": "arn:aws:s3:::artifact-source/*"
	},
	{
	    "Sid": "VisualEditor2",
	    "Effect": "Allow",
	    "Action": [
		"s3:Get*",
		"s3:Put*"
	    ],
	    "Resource": "arn:aws:s3:::artifact-source/*"
	}
    ]
}
</pre>
</div>
</div>
</div>
