aws/cross_account_pipeline.org
* Pass role

Cross-Account-RoleA POLIICES

AWSCodeCommitFullAccess		
AmazonS3FullAccess
AWSCodeDeployFullAccess
AmazonECSTaskExecutionRolePolicy
AWSCodeBuildAdminAccess
CrossAccount-Role-A-STS-Policy

Error calling startBuild: User: arn:aws:sts::548593215839:assumed-role/CrossAccount-role-A-ECS/1657207152885 is not authorized to perform: codebuild:StartBuild on resource: arn:aws:codebuild:us-east-1:548593215839:project/poc-548593215839-BuildProject because no identity-based policy allows the codebuild:StartBuild action (Service: AWSCodeBuild; Status Code: 400; Error Code: AccessDeniedException; Request ID: 6de88b05-0e0d-48e8-bfd6-8ccf621d65a6; Proxy: null)

# [SOLVED]: BY adding AWSCodeBuildAdminAccess policy in Cross-Account-Role-A


User: arn:aws:sts::548593215839:assumed-role/CrossAccount-role-A-ECS/1657207827303 is not authorized to perform: codedeploy:GetApplication on resource: arn:aws:codedeploy:us-east-1:548593215839:application:AppECS-poc-Cluster-poc-ECS-Service because no identity-based policy allows the codedeploy:GetApplication action

User: arn:aws:sts::548593215839:assumed-role/CrossAccount-role-A-ECS/1657208881769 is not authorized to perform: ecs:RegisterTaskDefinition on resource: * because no identity-based policy allows the ecs:RegisterTaskDefinition action

# [FAILED]: BY adding AWSCodeDeployFullAccess policy in Cross-Account-Role-A

# In ECS-Cluster Defination to run task-defination we use
#   arn:aws:iam::548593215839:role/poc-ExecutionRole

Policy:

AmazonECSTaskExecutionRolePolicy

Trust Relationship:

#+begin_src 
{
    "Version": "2008-10-17",
    "Statement": [
        {
            "Effect": "Allow",
            "Principal": {
                "Service": "ecs-tasks.amazonaws.com"
            },
            "Action": "sts:AssumeRole"
        }
    ]
}
#+end_src

** TODO Need policy allow ecs:RegisterTaskDefinition to Run using CrossAccount-role-A-ECS


* AWS CodeDeploy Blue / Green Deployment to Amazon ECS

https://www.youtube.com/watch?v=ekh2uW1VU6U
Create a CodeDeploy Task for ECS Bluegreen usign appspec.yaml file in s3 bucket

* Event Bridge for pipeline to codedeploy
https://www.youtube.com/watch?v=joxRfHu26zc

#+begin_src json
{
  "source": ["aws.codebuild"],
  "detail-type": ["CodeBuild Build State Change"],
 "Resource": ["arn:aws:codebuild:us-east-1:548593215839:project/poc-548593215839-BuildProject"],
  "detail": {
    "build-status": ["SUCCEEDED"]
  }
}
#+end_src



Service role ARN
arn:aws:iam::548593215839:role/BlueGreenService-CodeDeployRoleForECS

#+begin_src 
aws apprunner start-deployment --cli-input-json file://input.json
#+end_src

#+begin_src 
{
    "ServiceArn": "arn:aws:apprunner:us-east-1:123456789012:service/python-app/8fe1e10304f84fd2b0df550fe98a71fa"
}
#+end_src

https://docs.aws.amazon.com/cli/latest/reference/deploy/create-deployment.html
#+begin_src 
aws deploy create-deployment \
    --application-name WordPress_App \
    --deployment-config-name CodeDeployDefault.OneAtATime \
    --deployment-group-name WordPress_DG \
    --description "My demo deployment" \
    --s3-location bucket=CodeDeployDemoBucket,bundleType=zip,eTag=dd56cfdEXAMPLE8e768f9d77fEXAMPLE,key=WordPressApp.zip
#+end_src


#+begin_src json
{
    "applicationName": "AppECS-poc-Cluster-poc-ECS-Service",
    "deploymentGroupName": "DgpECS-poc-Cluster-poc-ECS-Service",
    "revision": {
        "revisionType": "S3",
        "s3Location": {
            "bucket": "cross-account-role-a-mybucket",
            "key": "appspec.yaml",
            "bundleType": "YAML"
        }
    }
}
#+end_src


#+begin_src 
aws deploy create-deployment \
    --cli-input-json file://create-deployment.json \
    --region us-east-1

aws deploy create-deployment --cli-input-json file://create-deployment.json --region us-east-1
#+end_src

#+begin_src 
import boto3

client = boto3.client('codedeploy')

response = client.continue_deployment(
    deploymentId='string',
    deploymentWaitType='READY_WAIT'|'TERMINATION_WAIT'
)

#+end_src
