aws/cross_account_pipeline.html




<div id="outline-container-org25e209e" class="outline-2">
<h2 id="org25e209e">Pass role</h2>
<div class="outline-text-2" id="text-org25e209e">
<p>
Cross-Account-RoleA POLIICES
</p>

<p>
AWSCodeCommitFullAccess		
AmazonS3FullAccess
AWSCodeDeployFullAccess
AmazonECSTaskExecutionRolePolicy
AWSCodeBuildAdminAccess
CrossAccount-Role-A-STS-Policy
</p>

<p>
Error calling startBuild: User: arn:aws:sts::548593215839:assumed-role/CrossAccount-role-A-ECS/1657207152885 is not authorized to perform: codebuild:StartBuild on resource: arn:aws:codebuild:us-east-1:548593215839:project/poc-548593215839-BuildProject because no identity-based policy allows the codebuild:StartBuild action (Service: AWSCodeBuild; Status Code: 400; Error Code: AccessDeniedException; Request ID: 6de88b05-0e0d-48e8-bfd6-8ccf621d65a6; Proxy: null)
</p>


<p>
User: arn:aws:sts::548593215839:assumed-role/CrossAccount-role-A-ECS/1657207827303 is not authorized to perform: codedeploy:GetApplication on resource: arn:aws:codedeploy:us-east-1:548593215839:application:AppECS-poc-Cluster-poc-ECS-Service because no identity-based policy allows the codedeploy:GetApplication action
</p>

<p>
User: arn:aws:sts::548593215839:assumed-role/CrossAccount-role-A-ECS/1657208881769 is not authorized to perform: ecs:RegisterTaskDefinition on resource: * because no identity-based policy allows the ecs:RegisterTaskDefinition action
</p>

<p>
Policy:
</p>

<p>
AmazonECSTaskExecutionRolePolicy
</p>

<p>
Trust Relationship:
</p>

<pre class="example">
{
    "Version": "2008-10-17",
    "Statement": [
	{
	    "Effect": "Allow",
	    "Principal": {
		"Service": "ecs-tasks.amazonaws.com"
	    },
	    "Action": "sts:AssumeRole"
	}
    ]
}
</pre>
</div>

<div id="outline-container-org99e9cc3" class="outline-3">
<h3 id="org99e9cc3"><span class="todo TODO">TODO</span> Need policy allow ecs:RegisterTaskDefinition to Run using CrossAccount-role-A-ECS</h3>
</div>
</div>


<div id="outline-container-org856cc14" class="outline-2">
<h2 id="org856cc14">AWS CodeDeploy Blue / Green Deployment to Amazon ECS</h2>
<div class="outline-text-2" id="text-org856cc14">
<p>
<a href="https://www.youtube.com/watch?v=ekh2uW1VU6U">https://www.youtube.com/watch?v=ekh2uW1VU6U</a>
Create a CodeDeploy Task for ECS Bluegreen usign appspec.yaml file in s3 bucket
</p>
</div>
</div>

<div id="outline-container-orgcb2bc60" class="outline-2">
<h2 id="orgcb2bc60">Event Bridge for pipeline to codedeploy</h2>
<div class="outline-text-2" id="text-orgcb2bc60">
<p>
<a href="https://www.youtube.com/watch?v=joxRfHu26zc">https://www.youtube.com/watch?v=joxRfHu26zc</a>
</p>

<div class="org-src-container">
<pre class="src src-json">{
  "source": ["aws.codebuild"],
  "detail-type": ["CodeBuild Build State Change"],
 "Resource": ["arn:aws:codebuild:us-east-1:548593215839:project/poc-548593215839-BuildProject"],
  "detail": {
    "build-status": ["SUCCEEDED"]
  }
}
</pre>
</div>



<p>
Service role ARN
arn:aws:iam::548593215839:role/BlueGreenService-CodeDeployRoleForECS
</p>

<pre class="example">
aws apprunner start-deployment --cli-input-json file://input.json
</pre>

<pre class="example">
{
    "ServiceArn": "arn:aws:apprunner:us-east-1:123456789012:service/python-app/8fe1e10304f84fd2b0df550fe98a71fa"
}
</pre>

<p>
<a href="https://docs.aws.amazon.com/cli/latest/reference/deploy/create-deployment.html">https://docs.aws.amazon.com/cli/latest/reference/deploy/create-deployment.html</a>
</p>
<pre class="example">
aws deploy create-deployment \
    --application-name WordPress_App \
    --deployment-config-name CodeDeployDefault.OneAtATime \
    --deployment-group-name WordPress_DG \
    --description "My demo deployment" \
    --s3-location bucket=CodeDeployDemoBucket,bundleType=zip,eTag=dd56cfdEXAMPLE8e768f9d77fEXAMPLE,key=WordPressApp.zip
</pre>


<div class="org-src-container">
<pre class="src src-json">{
    "applicationName": "AppECS-poc-Cluster-poc-ECS-Service",
    "deploymentGroupName": "DgpECS-poc-Cluster-poc-ECS-Service",
    "revision": {
	"revisionType": "S3",
	"s3Location": {
	    "bucket": "cross-account-role-a-mybucket",
	    "key": "appspec.yaml",
	    "bundleType": "YAML"
	}
    }
}
</pre>
</div>


<pre class="example">
aws deploy create-deployment \
    --cli-input-json file://create-deployment.json \
    --region us-east-1

aws deploy create-deployment --cli-input-json file://create-deployment.json --region us-east-1
</pre>

<pre class="example">
import boto3

client = boto3.client('codedeploy')

response = client.continue_deployment(
    deploymentId='string',
    deploymentWaitType='READY_WAIT'|'TERMINATION_WAIT'
)

</pre>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: DeepAlgorithms</p>
<p class="date">Created: 2023-03-16 Thu 11:44</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
